{
    "id": 1,
    "description": "The project is titled 'LLMGuard'. \n\nThis project developed a pipeline for bias and toxicity detection in outputs of large language models, such as GPT-2 and BERT, as well as a user-friendly UI (ReactJS) and backend (Django Rest Framework) for integration and usage. Skills used includes ReactJS, Django, Python, JavaScript. The project uses ReactJS, Django, Python, JavaScript. The project is titled 'Literature Society IITJ Website'. \n\nThis project is a website for Literature Society IIT Jodhpur, which will include user profile management, library management system, feature to upload written works to be displayed on the website, and moderator and admin access profiles to approve content. Skills used includes ReactJS, Django, Python, JavaScript. The project uses ReactJS, Django, Python, JavaScript. The project is titled 'CloudPhysician's Vital Extraction Challenge'. \n\nThis project used fine-tuned DETR and Detectron to segment images of ICU rooms and vitals from ICU monitors. Additionally, a graph digitisation algorithm was used to digitize ECG strips. Skills used includes Computer Vision, Image Processing. The project uses Computer Vision, Image Processing. The project is titled 'Multi Model Data Analysis for Annotation of Human Activities'. \n\nThis project focused on the analysis of accelerometer and gyroscope readings to detect human activity. A pipeline was created to clean and annotate the dataset, enabling the detection of outliers and the identification of activity types. Skills used includes Data Analysis, PyTorch, Tensorflow, Sklearn, Python. The project uses Data Analysis, PyTorch, Tensorflow, Sklearn, Python. The project is titled 'FaceNet Implementation'. \n\nThis project implemented FaceNet and Standard Siamese Network from scratch using PyTorch, and trained them on the CelebA dataset. The project was successful in replicating the original research paper. Skills used includes PyTorch, Python. The project uses PyTorch, Python. ",
    "personality_score": 4
}