{
    "id": 1,
    "description": "The project is titled 'LLMGuard'. \n\nThis project developed a pipeline for bias/toxicity detection in the outputs of large language models such as GPT-2 and BERT, and created a user-friendly interface with ReactJS and Django Rest Framework for integration and utilization of the pipeline. Skills used includes ReactJS, Django, Python, JavaScript. The project uses ReactJS, Django, Python, JavaScript. The project is titled 'Literature Society IITJ Website'. \n\nThis project involves the development of a website for the Literature Society of IIT Jodhpur, with features like user profile management, library management system, and an upload feature for written works to be displayed on the website. The website also has admin and moderator access profiles to approve books and contents. Skills used includes ReactJS, Django, Python, JavaScript. The project uses ReactJS, Django, Python, JavaScript. The project is titled 'CloudPhysician's Vital Extraction Challenge'. \n\nThis project used fine-tuned DETR and detectron to segment images of ICU rooms and vitals from ICU monitors. Additionally, a graph digitisation algorithm was developed to digitize ECG strips. Skills used includes Computer Vision, Image Processing. The project uses Computer Vision, Image Processing. The project is titled 'Multi Model Data Analysis for Annotation of Human Activities'. \n\nThis project focused on data analysis and outlier detection of accelerometer and gyroscope readings in order to detect the activity type. A pipeline was designed and implemented to clean the data and automatically predict the activity type. Skills used includes Data Analysis, PyTorch, Tensorflow, Sklearn, Python. The project uses Data Analysis, PyTorch, Tensorflow, Sklearn, Python. The project is titled 'FaceNet Implementation'. \n\nThis project implements the FaceNet research paper and a Standard Siamese network from scratch using PyTorch, and trains them on the CelebA dataset. The results show successful training of both models. Skills used includes PyTorch, Python. The project uses PyTorch, Python. ",
    "personality_score": 4
}