[
    {
        "id": 1,
        "name": "Shubh",
        "skills": [
            "HTML",
            "JavaScript",
            "CSS",
            "PyTorch",
            "ReactJS",
            "Django"
        ],
        "projects": [
            {
                "name": "LLMGuard",
                "description": "Developed pipeline for bias/toxicity detection in outputs of large language models and integrated GPT-2, BERT and other language models for testing. Developed user-friendly UI (ReactJS) and backend (Django Rest Framework) for integration of detectors and providing an intuitive platform for using the developed pipeline.",
                "skills": [
                    "ReactJS",
                    "Django",
                    "Python",
                    "JavaScript"
                ],
                "experience": 12
            },
            {
                "name": "Literature Society IITJ Website",
                "description": "A website developed for managing various activities for literature society of IIT Jodhpur. The website contains the following features: \n-User Profile Management (with in site notification service) \n-Library Management System \n-Feature to upload written works to be displayed on website (Reader's Section). \n-Moderator and Admin access profiles to approve books and contents.",
                "skills": [
                    "ReactJS",
                    "Django",
                    "Python",
                    "JavaScript"
                ],
                "experience": 10
            }
        ]
    },
    {
        "id": 3,
        "name": "Sukriti",
        "skills": [
            "Python",
            "C++",
            "Numpy",
            "Pandas",
            "Sklearn",
            "TensorFlow",
            "Pytorch",
            "OpenCV",
            "Computer Vision",
            "Image Processing",
            "Git",
            "Django Rest framework"
        ],
        "projects": [
            {
                "name": "Cloudphysician's Vital Extraction Challenge",
                "description": "Extracted the values of vitals from the images of ICU monitors and returned the values in form of a python dictionary. We used object detection to identify the relevant areas from the image and then applied text recognition.",
                "skills": [
                    "Computer Vision",
                    "Image Processing"
                ],
                "experience": 12
            },
            {
                "name": "Multi Model Data Analysis for Annotation of Human Activities",
                "description": "A pipeline which can predict human activities based on continuous analysis of data provided by accelerometer and gyroscope present in a smartwatch.",
                "skills": [
                    "Python",
                    "PyTorch",
                    "Tensorflow",
                    "Sklearn"
                ],
                "experience": 6
            }
        ]
    }
]